src/cf/InformationRegisters/ОшибкиПодключенияЭлектроннойПочтыУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиПодключенияЭлектроннойПочтыУНФ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПодробноеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОшибки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОшибкиПодключенияЭлектроннойПочтыУНФ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция КоличествоОшибокПодключения(Знач УчетнаяЗапись) Экспорт
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ОшибкиПодключенияЭлектроннойПочтыУНФ) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ОшибкиПодключенияЭлектроннойПочтыУНФ.ДатаОшибки) КАК КоличествоОшибокПодключения
	|ИЗ
	|	РегистрСведений.ОшибкиПодключенияЭлектроннойПочтыУНФ КАК ОшибкиПодключенияЭлектроннойПочтыУНФ
	|ГДЕ
	|	ОшибкиПодключенияЭлектроннойПочтыУНФ.УчетнаяЗапись = &УчетнаяЗапись");
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.КоличествоОшибокПодключения) Тогда
		Возврат Выборка.КоличествоОшибокПодключения;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Процедура ЗарегистрироватьОшибку(Знач УчетнаяЗапись, Знач ИнформацияОбОшибке) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УчетнаяЗапись = УчетнаяЗапись;
	МенеджерЗаписи.ДатаОшибки = ТекущаяДата();
	МенеджерЗаписи.ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ПревышеноДопустимоеКоличествоОшибок(Знач УчетнаяЗапись) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ОшибкиПодключенияЭлектроннойПочтыУНФ.ДатаОшибки) КАК КоличествоОшибок
	|ИЗ
	|	РегистрСведений.ОшибкиПодключенияЭлектроннойПочтыУНФ КАК ОшибкиПодключенияЭлектроннойПочтыУНФ
	|ГДЕ
	|	ОшибкиПодключенияЭлектроннойПочтыУНФ.УчетнаяЗапись = &УчетнаяЗапись");
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Если Не ЗначениеЗаполнено(Выборка.КоличествоОшибок) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Выборка.КоличествоОшибок >= МаксимальноеКоличествоОшибокПодключения();
	
КонецФункции

Процедура ОчиститьЗарегистрированныеОшибки(Знач УчетнаяЗапись) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОшибкиПодключенияЭлектроннойПочтыУНФ.ДатаОшибки
	|ИЗ
	|	РегистрСведений.ОшибкиПодключенияЭлектроннойПочтыУНФ КАК ОшибкиПодключенияЭлектроннойПочтыУНФ
	|ГДЕ
	|	ОшибкиПодключенияЭлектроннойПочтыУНФ.УчетнаяЗапись = &УчетнаяЗапись");
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УчетнаяЗапись.Установить(УчетнаяЗапись);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ДанныеЗапросом(УчетнаяЗапись) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОшибкиПодключенияЭлектроннойПочтыУНФ.ДатаОшибки КАК ДатаОшибки,
		|	ОшибкиПодключенияЭлектроннойПочтыУНФ.ПодробноеПредставлениеОшибки КАК ПодробноеПредставлениеОшибки
		|ИЗ
		|	РегистрСведений.ОшибкиПодключенияЭлектроннойПочтыУНФ КАК ОшибкиПодключенияЭлектроннойПочтыУНФ
		|ГДЕ
		|	ОшибкиПодключенияЭлектроннойПочтыУНФ.УчетнаяЗапись = &УчетнаяЗапись";
	
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МаксимальноеКоличествоОшибокПодключения()
	
	Возврат 100;
	
КонецФункции

#КонецОбласти

#КонецЕсли
